Emacs.org
#+TITLE: Emacs Configuration
#+AUTHOR: Parth Trivedi
#+DESCRIPTION: My Emacs Configuration that I use on a daily basis for writing
#+PROPERTY: header-args:emacs-lisp :tangle ./.emacs.d/init.el :comments org

* General
** Basic Stuff
*** No flashing or alerting
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (setq ring-bell-function 'ignore)
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

*** Remove bar
#+begin_src emacs-lisp
  (scroll-bar-mode -1)    ; Remove bar
  (tool-bar-mode -1)      ; Disable the tool bar
  (tooltip-mode -1)       ; Disable tooltips
  (set-fringe-mode 10)    ; Provide breathing room
  (menu-bar-mode 0)       ; Remove Menu Bar
#+end_src
*** Font
#+begin_src emacs-lisp
  (defun fontify-frame (frame)
    (set-frame-parameter frame 'font "Jet Brains Mono-9"))

  ;; Fontify current frame
  (fontify-frame nil)

  ;; Fontify any future frames
  (push 'fontify-frame after-make-frame-functions)
#+end_src
*** Line Numbers
#+begin_src emacs-lisp
  (global-display-line-numbers-mode)
  (setq display-line-numbers-type 'visual)
  (dolist (mode '(org-mode-hook
                  org-agenda-mode-hook
                  dired-mode-hook
                  image-mode-hook
                  pdf-view-mode-hook
                  term-mode-hook ))
                  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src
*** Make ESC quit prompts
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src
*** Move to trash instead of delete
#+begin_src emacs-lisp
  (setq delete-by-moving-to-trash t)
#+end_src
*** Tab
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)
#+end_src
** Use package
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
      (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
      (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src
** Backups
Write backups to ~/.emacs.d/backup/
#+begin_src emacs-lisp
(setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
      backup-by-copying      t  ; Don't de-link hard links
      version-control        t  ; Use version numbers on backups
      delete-old-versions    t  ; Automatically delete excess backups:
      kept-new-versions      20 ; how many of the newest versions to keep
      kept-old-versions      5) ; and how many of the old
#+end_src
** Theme
#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    (load-theme 'doom-tomorrow-night t)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t)
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src
** Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 5)
    (display-time-mode 't))
#+end_src
** Icons
#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src
** Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle 0.3))
#+end_src
** Keybindings
#+begin_src emacs-lisp
  (use-package general
    :ensure t
    :config
    (general-create-definer pt/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

  (pt/leader-keys
    "SPC" '(find-file :which-key "files")
    "RET" '(counsel-bookmark :which-key "bookmarks"))

  (pt/leader-keys
    "b" '(:ignore b :which-key "buffer")
    "bk" '(kill-this-buffer :which-key "kill")
    "bi" '(ibuffer :which-key "ibuffer")
    "bb" '(switch-to-buffer :which-key "switch")
    "br" '(revert-buffer-quick :which-key "revert"))

  (pt/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tv" '(visual-line-mode :which-key "visual line mode")
    "ts" '(hydra-text-scale/body :which-key "scale text"))

  (pt/leader-keys
    "w" '(:ignore w :which-key "window")
    "ws" '(evil-window-split :which-key "horizontal split")
    "wv" '(evil-window-vsplit :which-key "vertical split")
    "wd" '(evil-window-delete :which-key "delete")
    "wr" '(evil-window-rotate-upwards :which-key "rotate")
    "wh" '(evil-window-left :which-key "left")
    "wj" '(evil-window-down :which-key "down")
    "wk" '(evil-window-up :which-key "up")
    "wl" '(evil-window-right :which-key "right"))

  (pt/leader-keys
    "o" '(:ignore o :which-key "open")
    "oe" '(eshell :which-key "eshell"))

  (pt/leader-keys
    "o" '(:ignore O :which-key "")
    "oa" '(org-agenda :which-key "agenda")
    "oc" '(org-capture :which-key "capture"))

  (global-set-key (kbd "M-/") 'comment-or-uncomment-region)
#+end_src

** Ivy
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))
#+end_src

** Counsel
#+begin_src emacs-lisp
  (use-package counsel
    :ensure t
    :config (counsel-mode))

  (global-set-key (kbd "M-x") 'counsel-M-x)
#+end_src
** Hydra
#+begin_src emacs-lisp
  (use-package hydra)
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

#+end_src
** Evil
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
    (define-key evil-normal-state-map (kbd "?") 'replace-regexp)
 
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src
** Persp
#+begin_src emacs-lisp
  (use-package persp-mode
    :ensure t
    :config
    (setq persp-autokill-buffer-on-remove t)
    (persp-mode)
    (pt/leader-keys
      "k" '(:ignore k :which-key "workspaces")
      "ka" '(persp-add-buffer :which-key "add")
      "ks" '(persp-switch :which-key "switch")
      "kr" '(persp-remove-buffer :whick-key "remove")
      "kb" '(persp-switch-to-buffer :which-key "buffer")
      "kk" '(persp-kill :which-key "kill")
      ))

#+end_src
** Company
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :init
    (add-hook 'after-init-hook 'global-company-mode)
    :config
    (setq company-idle-delay 0))

  (use-package company-box
    :ensure t
    :after (company-mode)
    :hook (company-mode . company-box-mode))
#+end_src
** Pdf Tools
#+begin_src emacs-lisp
  (use-package pdf-tools
    :ensure t
    :init (pdf-tools-install))
#+end_src
** Transparency
#+begin_src emacs-lisp
  (setq transparent 'nil)

  (defun set-transparency (value)
    "Set transparency based on value passed"
    (set-frame-parameter (selected-frame) 'alpha `(,value 100))
    (add-to-list 'default-frame-alist `(alpha ,value 100)))

  (defun toggle-transparency ()
    "Toggle transparency function"
    (interactive)
    (if transparent
        (progn
          (set-transparency 100)
          (setq transparent 'nil))

      (progn
        (set-transparency 85)
        (setq transparent 't))
      ))

  (pt/leader-keys
    "tt" '(toggle-transparency :which-key "transparency"))

#+end_src
