Emacs.org
** Moving Frames
#+begin_src emacs-lisp
  (global-set-key (kbd "<prior>") 'ns-next-frame)
  (global-set-key (kbd "<next>") 'ns-prev-frame)
#+end_src
** Macros
*** Org Capture Todo
#+begin_src emacs-lisp
  (fset 'open-org-capture-todo
     (kmacro-lambda-form [?  ?o ?c ?t] 0 "%d"))

#+end_src
** Rainbow Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Notifications
#+begin_src emacs-lisp
  (use-package alert
    :commands alert
    :config
    (setq alert-default-style 'notifications))
#+end_src

* Org Mode
** Org Configuration
#+begin_src emacs-lisp
  (setq org-directory "~/org/")

  (defun pt/org-mode-setup ()
    (org-indent-mode)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    ;; (flyspell-mode)
    (setq evil-auto-indent nil))

  (use-package org
    :hook ((org-mode . pt/org-mode-setup))
    :bind (:map org-mode-map
                ("C-C e" . org-mobile-push)
                ("C-c i" . org-mobile-pull)
                ("C-c l" . latex-frag)
                ("C-c L" . latex-frag-mult)
                ("C-c R" . org-table-sort-lines)
                ("C-c [" . org-reftex-citation))

    :config
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t)
    (setq org-image-actual-width nil))

  (setq org-hide-emphasis-markers t)
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                           '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (setq org-duration-format (quote h:mm))
#+end_src
** Org Habits
#+begin_src emacs-lisp
  (setq org-modules '(org-habit))
  (org-load-modules-maybe t)
#+end_src
** Org Citations
#+begin_src emacs-lisp
  (use-package org-ref
    :ensure t
    :after org)
#+end_src
** Latex Fragments
#+begin_src 
#+end_src
*** Single line
#+begin_src emacs-lisp
  (fset 'latex-frag
        (kmacro-lambda-form [?i ?\\ ?b ?e ?g ?i ?n ?\{ ?\} escape ?i ?e ?q ?a backspace ?u ?a ?t ?i ?o ?n escape ?y ?y ?p ?w ?c ?w ?e ?n ?d escape ?O escape ?\s-s] 0 "%d"))
#+end_src

*** Multiline 
#+begin_src emacs-lisp
(fset 'latex-frag-mult
   (kmacro-lambda-form [?i ?\\ ?b ?e ?g ?i ?n ?\{ ?e ?q ?u ?a ?t ?i ?o ?n ?\} escape ?y ?y ?p ?l ?w ?w ?c ?w ?s ?p ?l ?i ?t escape ?y ?y ?p ?w ?c ?w ?e ?n ?d escape ?k ?k ?y ?y ?j ?j ?p ?w ?c ?w ?e ?n ?d escape ?k ?O escape] 0 "%d"))

#+end_src

** Custom Faces
#+begin_src emacs-lisp
  (setq toggle-org-faces-check t)

  (defun toggle-org-faces ()
    "Toggle org level headings whether to be normal font size or in increasing font size."
    (interactive)
    (if toggle-org-faces-check
        (progn
          (custom-set-faces
           '(org-level-1 ((t (:inherit outline-1 :height 1.4))))
           '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
           '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
           '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
           '(org-level-5 ((t (:inherit outline-5 :height 1.1)))))
          (setq toggle-org-faces-check nil)
          )
      (progn
          (custom-set-faces
           '(org-level-1 ((t (:inherit outline-1 :height 1.2))))
           '(org-level-2 ((t (:inherit outline-2 :height 1.2))))
           '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
           '(org-level-4 ((t (:inherit outline-4 :height 1.2))))
           '(org-level-5 ((t (:inherit outline-5 :height 1.2)))))
          (setq toggle-org-faces-check t)
          )
    )
  )

  (pt/leader-keys
    "th" '(toggle-org-faces :which-key "Headings"))
#+end_src
** Agenda
#+begin_src emacs-lisp
  (setq org-agenda-files '("~/org/Todos.org" "~/org/Projects.org" "~/org/Repeated.org"))
  (setq org-agenda-skip-deadline-if-done t
        org-agenda-skip-scheduled-if-done t)
#+end_src
** Capture
#+begin_src emacs-lisp
  (setq org-default-notes-file (concat org-directory "/notes.org"))
  (setq todos-file "~/org/Todos.org"
        projects-file "~/org/Projects.org"
        later-file "~/org/Later.org"
        repeat-file "~/org/Repeated.org")
  (setq org-capture-templates
        '(("t" "Todo" entry (file todos-file)
           "* TODO %?\n %i\n")
          ("s" "School" entry (file todos-file)
           "* TODO %? :school:\n")
          ("S" "School Project" entry (file projects-file)
           "* TODO %? [/] :school:\n")
          ("p" "Project" entry (file projects-file)
           "* TODO %? [/]\n#+COOKIE_DATA:todo\n %i\n")
          ("l" "Something for Later" entry (file later-file)
           "** %?\n %i\n")
          ("r" "Repeated Task" entry (file repeated-file)
           "** %?\n %i\n")
          ("i" "Idea" entry (file+headline "~/org/Ideas.org" "Other")
           "** %?\n %i\n ")
          ("B" "Book" entry (file+headline "~/org/Books.org" "Other")
           "** TODO %?\n")
          ("b" "Blog" entry (file create-new-blog-post))
          ("I" "Invoice" entry (file "~/Work/Invoices/Invoices.org")
           "* %?\n#+ENTITY: \n#+ADDRESS: \n#+DUEDATE: \n| Quantity | Description | Unit Price | Total |\n|----------+-------------+------------+-------|")
          ))
#+end_src
** Refile
#+begin_src emacs-lisp
  (setq org-refile-targets
        '(("~/org/Todos.org" :maxlevel . 1)
          ("~/org/Projects.org" :maxlevel . 1)
          ("~/org/Repeated.org" :maxlevel . 1)
          ("~/org/Later.org" :maxlevel . 1)
          ("~/org/Ideas.org" :maxlevel . 1)
          ("~/org/Books.org" :maxlevel . 1)))

  (setq org-refile-allow-creating-parent-nodes 'confirm
        org-refile-use-outline-path 'file
        org-outline-path-complete-in-steps nil)
#+end_src
** Tags
#+begin_src emacs-lisp
  (setq org-tag-alist '((:startgroup)
                        ("@work" . ?W)
                        ("@home" . ?H)
                        (:endgroup)
                        ("work" . ?w)
                        ("privy" . ?p)
                        ("health" . ?h)
                        ("learn" . ?l)
                        ("school" . ?s)
                        ("dev" . ?d)
                        ("paid" . ?P)
                        ("volunteer" . ?V)
                        ("DAILY" . ?D)
                        ("crypt" . ?c)))
#+end_src
** Keywords
#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequencep "TODO(t)" "NEXT(n)" "ONGOING(o)" "|" "DONE(d/!)")
          (sequencep "WAITING(w@/!)" "|" "CANCELLED(c@/!)" "PAUSED(p@/!)" "MEETING")))
#+end_src
** Keyword Faces
#+begin_src emacs-lisp
  (setq org-todo-keyword-faces
        '(("TODO" :foreground "Purple" :weight bold )
          ("ONGOING" :foreground "Orange" :weight bold)
          ("NEXT" :foreground "DeepSkyBlue" :weight bold)
          ("DONE" :foreground "SeaGreen3" :weight bold)
          ("WAITING" :foreground "DeepSkyBlue" :weight bold)
          ("CANCELLED" :foreground "Red" :weight bold)
          ("PAUSED" :foreground "OrangeRed" :weight bold)
          ("MEETING" :foreground "forest green" :weight bold)))
#+end_src
