Emacs.org
** Views
#+begin_src emacs-lisp
  (setq org-agenda-dim-blocked-tasks nil)
  (setq org-agenda-custom-commands
        '(
          ("m" "Main"
           ((agenda ""
                    ((org-agenda-span 'day)
                     (org-agenda-show-all-dates nil)
                     (org-scheduled-past-days 0)
                     (org-agenda-entry-types '(:scheduled :timestamp))))
            (agenda ""
                    ((org-agenda-span 'month)
                     (org-agenda-time-grid nil)
                     (org-agenda-show-all-dates nil)
                     (org-agenda-entry-types '(:deadline))
                     (org-deadline-warning-days 0)
                     (org-agenda-overriding-header "Upcoming Deadlines")))
            (todo "ONGOING"
                  ((org-agenda-overriding-header "Ongoing Tasks")))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Next Tasks")))
            (todo "WAITING"
                  ((org-agenda-overriding-header "Waiting On")))
            )
           nil "~/Agenda/all.html")
          ("u" "Upcoming"
           ((agenda ""
                   ((org-agenda-span 'week)
                    (org-agenda-grid nil)
                    (org-agenda-show-all-dates nil)
                    (org-agenda-entry-types '(:scheduled))
                     (org-scheduled-past-days 0)
                    (org-agenda-files '("~/org/Todos.org" "~/org/Projects.org"))
                    (org-agenda-overriding-header "Upcoming Tasks")))
           (agenda ""
                   ((org-agenda-span 'week)
                    (org-agenda-grid nil)
                    (org-agenda-show-all-dates nil)
                    (org-agenda-entry-types '(:deadline))
                    (org-deadline-warning-days 0)
                    (org-agenda-overriding-header "Upcoming Deadlines")))))
          ))
#+end_src
** Mobile
#+begin_src emacs-lisp
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
  (setq org-mobile-inbox-for-pull "~/org/flagged.org")
  (setq org-mobile-files (list "~/org/Ideas.org"
                               "~/org/Books.org"
                               "~/org/gtd.org"
                               "~/org/Learn.org"
                               "~/org/Shows to watch.org"))

#+end_src
** Crypt
#+begin_src emacs-lisp
  (use-package org-crypt
    :ensure nil
    :after org
    :bind (:map org-mode-map
                ("C-c d" . org-decrypt-entry))
    :config
    (org-crypt-use-before-save-magic)
    (setq org-tags-exclude-from-inheritance '("crypt"))
    :custom
    (setq org-crypt-key "0x577FBF62"))

#+end_src
** Epa
#+begin_src emacs-lisp
  (use-package epa
    :ensure t
    :config
    (custom-set-variables '(epa-gpg-program "/usr/local/bin/gpg"))
    (epa-file-enable))
#+end_src
** Babel
*** Tangle on save
#+begin_src emacs-lisp
  (defun pt/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
                          (expand-file-name "~/.dotfiles/Emacs.org"))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'pt/org-babel-tangle-config)))
#+end_src
** Roam
#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Wiki")
    (org-roam-completion-everywhere t)
    (org-roam-capture-templates
     '(("d" "default" plain
        "%?"
        :if-new (file+head "${slug}-%<%H%M%d%m%Y>.org" "#+title: ${title}\n")
        :unnarrowed t)))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           :map org-mode-map
           ("C-M-i"    . completion-at-point))
    :config
    (org-roam-setup))
#+end_src

*** Roam UI
#+begin_src emacs-lisp
  (use-package org-roam-ui
    :ensure t
    :after org-roam
    :bind (("C-c n u" . org-roam-ui-mode))
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src
** Journal
#+begin_src emacs-lisp
  (use-package org-journal
    :ensure t
    :init
    (pt/leader-keys
      "oj" '(org-journal-new-entry :which-key "journal"))
    :config
    (setq org-journal-dir "~/journal/"
          org-journal-date-format "%A, %d %B %Y"))
#+end_src
** toc
#+begin_src emacs-lisp
  (use-package toc-org
    :ensure t
    :config (add-hook 'org-mode-hook 'toc-org-mode))
#+end_src
** Exports
*** iCal
#+begin_src emacs-lisp
  (setq org-icalendar-use-scheduled '(event-if-todo-not-done))
#+end_src
*** Html
#+begin_src emacs-lisp
  (setq org-html-head "<link rel='stylesheet' type='text/css' href='~/.dotfiles/.emacs.d/html_export.css' />")
#+end_src
*** Latex
#+begin_src emacs-lisp
  (setq org-latex-toc-command "\\tableofcontents \\clearpage")
  (setq org-latex-packages-alist '(("margin=1.7cm" "geometry" nil)))

  (setq org-latex-listings t)
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (add-to-list 'org-latex-packages-alist '("" "tabularx"))
  (add-to-list 'org-latex-packages-alist '("" "longtable"))

  (with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                 '("org-plain-latex"
                   "\\documentclass{article}
               [NO-DEFAULT-PACKAGES]
               [PACKAGES]
               [EXTRA]"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src
** Presentations
#+begin_src emacs-lisp
  (use-package org-tree-slide
    :ensure t
    :after org
    :config
    (setq org-tree-slide-slide-in-effect nil))

  (pt/leader-keys
    "op" '(org-tree-slide-mode :which-key "Present"))
#+end_src
** Temporary Buffer
#+begin_src emacs-lisp
  (defun create-tmp-org ()
    "Create a temporary org buffer"
    (interactive)
    (create-file-buffer "tmp.org")
    (persp-add-buffer "tmp.org")
    (switch-to-buffer "tmp.org")
    (org-mode))

  (pt/leader-keys
    "oo" '(create-tmp-org :which-key "tmp org"))
#+end_src

* Writing
** Writeroom
#+begin_src emacs-lisp
  (use-package writeroom-mode
    :ensure t
    :config
    (setq writeroom-width 130)
    (pt/leader-keys
      "tw" '(writeroom-mode :which-key "Writeroom")))
#+end_src
** Blog
#+begin_src emacs-lisp
  (defun create-new-blog-post ()
    "Create a new blog post based on passed name and date in blog-dir"
    (interactive)
    (let ((name (read-string "Enter blog title: ")))
      (expand-file-name (format "%s-%s.org"
                                (string-join (string-split name " ") "_")
                                (format-time-string "%d%m%Y"))
                        "~/Blog/")))
#+end_src

* COMMENT Programming
#+begin_src emacs-lisp
  (define-key prog-mode-map (kbd "C-c e s") #'eglot)
  (define-key prog-mode-map (kbd "C-c e r") #'eglot-reconnect)
  (define-key prog-mode-map (kbd "C-c e a") #'eglot-code-actions)
  (define-key prog-mode-map (kbd "C-c e p") #'flycheck-previous-error)
  (define-key prog-mode-map (kbd "C-c e n") #'flycheck-next-error)
#+end_src

** Git
*** Magit
#+begin_src emacs-lisp
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    :config
    (pt/leader-keys
      "g" '(:ignore g :which-key "git")
      "gs" '(magit-stage-file :which-key "stage file")
      "gS" '(magit-stage :which-key "stage all")
      "gc" '(magit-commit :which-key "commit")
      "gg" '(magit-status :which-key "status")))
#+end_src
*** Git Gutter
#+begin_src emacs-lisp
  (use-package git-gutter
    :ensure t
    :config
    (global-git-gutter-mode t))

  (pt/leader-keys
    "tg" '(git-gutter-mode :which-key "gutter"))
#+end_src
