.emacs.d/init.el

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects")))
  (setq projectile-switch-project-action #'projectile-dired)

  (pt/leader-keys
    "p" '(:ignore p :which-key "projects")
    "pp" '(projectile-switch-project :which-key "switch to project")
    "pt" '(projectile-test-project :which-key "test project")
    "pf" '(projectile-find-file :which-key "find file")))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

(use-package persp-mode-projectile-bridge
  :ensure t
  :after (persp projectile))

(persp-mode-projectile-bridge-mode)

;; Syntax Checking

(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode))

;; Python

(use-package elpy
  :ensure t
  :defer t
  :init
  (advice-add 'python-mode :before 'elpy-enable))

(use-package pyvenv
  :config
  (pyvenv-mode 1))

;; Go

(use-package go-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode)))

;; Web

(use-package web-mode
  :ensure t)

;; Emmet

(use-package emmet-mode
  :ensure t
  :hook ((web-mode . emmet-mode)
         (js-mode . emmet-mode))
  :config
  (setq emmet-move-cursor-between-quotes t))

;; JSX

(use-package rjsx-mode
  :mode ("\\.js\\'"
         "\\.jsx\\'")
  :config
  (setq js2-mode-show-parse-errors nil
        js2-mode-show-strict-warnings nil
        js2-basic-offset 2
        js-indent-level 2))

;; Terminal

(use-package vterm
  :ensure t )

(pt/leader-keys
  "oT" '(vterm :which-key "terminal"))

;; Toggle

(use-package vterm-toggle
  :ensure t)

(pt/leader-keys
  "ot" '(vterm-toggle :which-key "terminal"))

;; Comments

(use-package hl-todo
  :ensure t
  :hook (prog-mode)
  :bind (:map hl-todo-mode-map
              ("C-c t n" . hl-todo-next)
              ("C-c t p" . hl-todo-previous)
              ("C-c t l" . hl-todo-occur)))

 (setq hl-todo-keyword-faces
  '(("TODO"   . "#cc9393")
    ("FIXME"  . "#cc9393")
    ("NOTE"   . "#d0bf8f")
    ("BUG"    . "#8c5353")))

;; Code Folding

(use-package origami
  :hook (prog-mode))

;; Language Server Protocol

(use-package eglot
  :ensure t)

;; CSV

(use-package csv-mode
  :ensure t
  :mode ("\\.csv\\'")
  :hook (csv-mode . csv-align-mode)
  )

;; Ledger

(use-package ledger-mode
  :ensure t
  :mode ("\\.journal\\'" "\\.ledger.*\\'"))

(setq ledger-binary-path "hledger")
(setq ledger-mode-should-check-version nil)
(add-to-list 'auto-mode-alist '("\\.\\(h?ledger\\|journal\\|j\\)$" . ledger-mode))

(defvar ledger-report-balance
  (list "bal" (concat ledger-binary-path " -f %(ledger-file) bal")))

(defvar ledger-report-reg
  (list "reg" (concat ledger-binary-path " -f %(ledger-file) reg")))

(defvar ledger-report-payee
  (list "payee" (concat ledger-binary-path " -f %(ledger-file) reg @%(payee)")))

(defvar ledger-report-account
  (list "account" (concat ledger-binary-path " -f %(ledger-file) reg %(account)")))

(setq ledger-reports
      (list ledger-report-balance
            ledger-report-reg
            ledger-report-payee
            ledger-report-account))

;; Centered Window

(use-package centered-window
  :ensure t
  :config
  (pt/leader-keys
    "tc" '(centered-window-mode :which-key "center"))
  (setq cwm-centered-window-width 140))

;; Mu4e

(use-package mu4e
    :load-path  "/usr/local/share/emacs/site-lisp/mu4e/")

;; Refresh mail using isync every 10 minutes
(setq mu4e-update-interval (* 10 60))
(setq mu4e-get-mail-command "mbsync -a")

(setq mu4e-maildir (expand-file-name "~/.mail"))

(setq mu4e-view-show-addresses t
      message-kill-buffer-on-exit t
      mu4e-context-policy 'pick-first
      mu4e-confirm-quit nil)

(pt/leader-keys
  "m" '(mu4e :which-key "Mail"))

;; Set how email is to be sent
(setq send-mail-function (quote smtpmail-send-it))

;; Split view
(setq mu4e-split-view 'vertical)

;; Accounts

(setq mu4e-user-mail-address-list '("superparthman@gmail.com"
                                    "parthtrivedi.co@gmail.com"))

(setq mu4e-contexts
      (list
       ;; Personal account
       (make-mu4e-context
        :name "Personal"
        :match-func
        (lambda (msg)
          (when msg
            (string-prefix-p "/Gmail" (mu4e-message-field msg :maildir))))
        :vars '((user-mail-address . "superparthman@gmail.com")
                (user-full-name    . "Parth Trivedi")
                (smtpmail-smtp-server  . "smtp.gmail.com")
                (smtpmail-smtp-service . 465)
                (smtpmail-stream-type  . ssl)
                (mu4e-drafts-folder  . "/Personal/[Gmail]/Drafts")
                (mu4e-sent-folder  . "/Personal/[Gmail]/Sent Mail")
                (mu4e-refile-folder  . "/Personal/[Gmail/All Mail")
                (mu4e-trash-folder  . "/Personal/[Gmail/Trash")))
       (make-mu4e-context
        :name "Work"
        :match-func
        (lambda (msg)
          (when msg
            (string-prefix-p "/Gmail" (mu4e-message-field msg :maildir))))
        :vars '((user-mail-address . "parthtrivedi.co@gmail.com")
                (user-full-name    . "Parth Trivedi")
                (smtpmail-smtp-server  . "smtp.gmail.com")
                (smtpmail-smtp-service . 465)
                (smtpmail-stream-type  . ssl)
                (mu4e-drafts-folder  . "/Work/[Gmail]/Drafts")
                (mu4e-sent-folder  . "/Work/[Gmail]/Sent Mail")
                (mu4e-refile-folder  . "/Work/[Gmail]/All Mail")
                (mu4e-trash-folder  . "/Work/[Gmail]/Trash")))
       ))

;; Alerts

(use-package mu4e-alert
  :ensure t
  :hook (after-init)
  :after mu4e
  (mu4e-alert-set-default-style 'libnotify)
  (mu4e-alert-enable-notifications)
  (mu4e-alert-enable-mode-line-display)
  (mu4e-alert-mode t))

;; Elfeed

(use-package elfeed
  :ensure t
  :config
  (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
        elfeed-show-entry-switch 'display-buffer))

(defun update-and-open-elfeed ()
  (interactive)
  (elfeed-org)
  (elfeed-update)
  (elfeed))

(pt/leader-keys
  "or" '(update-and-open-elfeed :which-key "elfeed"))

;; Elfeed Org

(use-package elfeed-org
  :ensure t
  :config
  (setq elfeed-show-entry-switch 'display-buffer)
  (setq rmh-elfeed-org-files (list "~/org/elfeed.org"))
  :init
  (elfeed-org))

;; Invoice Maker

(defun get-invoice-value (keyword)
  "Get keyword value based on passed value"
  (setq tags (org-collect-keywords keyword))
  (list (cadar tags) (cadadr tags) (cadar (cddr tags)))
  )

(defun create-invoice ()
  "Get key details for generating invoices."
  (interactive)
  (setq values (get-invoice-value '("ENTITY" "ADDRESS" "DUEDATE")))
  (org-table-export "~/Work/Invoices/invoice.csv")
  (async-shell-command (format "invoice -c=/home/parth/Work/Invoices/invoice.csv -e=\"%s\" -a=\"%s\" -d=\"%s\""
                         (car values)
                         (cadr values)
                         (caddr values)))
  )
